Revit 2024 API
BuiltInFailures.WallFailures Class
 Failures about Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class WallFailures
Visual Basic
Public NotInheritable Class WallFailures
Visual C++
public ref class WallFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.WallFailures
See Also
BuiltInFailures.WallFailures Members
Autodesk.Revit.DB Namespace